Revit 2024 API
BuiltInFailures.OverlapFailures.RoomSeparationLinesOverlap Property
 Highlighted room separation lines overlap. One of them may be ignored when Revit finds room boundaries. Delete one of the lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RoomSeparationLinesOverlap { get; }
Visual Basic
Public Shared ReadOnly Property RoomSeparationLinesOverlap As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RoomSeparationLinesOverlap {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.OverlapFailures Class
Autodesk.Revit.DB Namespace